In [2]:
import pandas as pd 
import numpy as np

In [3]:
start_date = '20210101'
ave_data = np.array(np.arange(24)).reshape((6, 4))
dates = pd.date_range(start_date, periods=6)
ave_df = pd.DataFrame(ave_data, index=dates, columns=list('1234'))
ave_df

             1   2   3   4
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19
2021-01-06  20  21  22  23

In [4]:
ave_df['4']

2021-01-01     3
2021-01-02     7
2021-01-03    11
2021-01-04    15
2021-01-05    19
2021-01-06    23
Freq: D, Name: 4, dtype: int64

In [5]:
ave_df[1:4]

             1   2   3   4
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15

In [6]:
ave_df['2021-01-01':'2021-01-05']

             1   2   3   4
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19

In [7]:
ave_df.loc[dates[1:3]]

            1  2   3   4
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [8]:
ave_df.loc[:,['1', '3']]

             1   3
2021-01-01   0   2
2021-01-02   4   6
2021-01-03   8  10
2021-01-04  12  14
2021-01-05  16  18
2021-01-06  20  22

In [9]:
ave_df.loc['2021-01-01':'2021-01-03',['1', '3']]

            1   3
2021-01-01  0   2
2021-01-02  4   6
2021-01-03  8  10

In [10]:
ave_df.loc['2021-01-01', ['1', '3']] [1] * 5

/var/folders/xz/rfbft5295y53fp00snkfjx900000gn/T/ipykernel_26597/2239835309.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ave_df.loc['2021-01-01', ['1', '3']] [1] * 5

np.int64(10)

In [11]:
ave_df.loc['2021-01-02', ['1', '3']] [0] * 5

/var/folders/xz/rfbft5295y53fp00snkfjx900000gn/T/ipykernel_26597/2497824705.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ave_df.loc['2021-01-02', ['1', '3']] [0] * 5

np.int64(20)

In [12]:
ave_df.loc[dates[1], '1']

np.int64(4)

In [13]:
ave_data[2]

array([ 8,  9, 10, 11])

In [14]:
ave_df.iloc[2]

1     8
2     9
3    10
4    11
Name: 2021-01-03 00:00:00, dtype: int64

In [15]:
ave_df.iloc[1:3, 2:5]

             3   4
2021-01-02   6   7
2021-01-03  10  11

In [16]:
ave_df.iloc[[0,1,3], [0,2]]

             1   3
2021-01-01   0   2
2021-01-02   4   6
2021-01-04  12  14

In [17]:
ave_df.iloc[1:3, :]

            1  2   3   4
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [18]:
ave_df.iloc[:, 1:3]

             2   3
2021-01-01   1   2
2021-01-02   5   6
2021-01-03   9  10
2021-01-04  13  14
2021-01-05  17  18
2021-01-06  21  22

In [19]:
ave_df[ave_df >= 5]

               1     2     3     4
2021-01-01   NaN   NaN   NaN   NaN
2021-01-02   NaN   5.0   6.0   7.0
2021-01-03   8.0   9.0  10.0  11.0
2021-01-04  12.0  13.0  14.0  15.0
2021-01-05  16.0  17.0  18.0  19.0
2021-01-06  20.0  21.0  22.0  23.0

In [20]:
ave_data = np.array(np.arange(40)).reshape((10, 4))
dates = pd.date_range('20210101', periods=10)
ave_df = pd.DataFrame(ave_data, index=dates, columns=list('ABCD'))
ave_df

             A   B   C   D
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19
2021-01-06  20  21  22  23
2021-01-07  24  25  26  27
2021-01-08  28  29  30  31
2021-01-09  32  33  34  35
2021-01-10  36  37  38  39

In [21]:
ave_df_cars = ave_df.copy()
ave_df_cars['Cars'] = ['Ford', 'Opel', 'Mazda', 'Mitsubishi', 'Renault', 'Lada', 'Hammer', 'BMW', 'Mercedes', 'VW']
ave_df_cars

             A   B   C   D        Cars
2021-01-01   0   1   2   3        Ford
2021-01-02   4   5   6   7        Opel
2021-01-03   8   9  10  11       Mazda
2021-01-04  12  13  14  15  Mitsubishi
2021-01-05  16  17  18  19     Renault
2021-01-06  20  21  22  23        Lada
2021-01-07  24  25  26  27      Hammer
2021-01-08  28  29  30  31         BMW
2021-01-09  32  33  34  35    Mercedes
2021-01-10  36  37  38  39          VW

In [22]:
pd.date_range(start_date, periods=10)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [23]:
pd.Series([1,2,3,4,5,6,7,8,9,10], index=pd.date_range(start_date, periods=10))

2021-01-01     1
2021-01-02     2
2021-01-03     3
2021-01-04     4
2021-01-05     5
2021-01-06     6
2021-01-07     7
2021-01-08     8
2021-01-09     9
2021-01-10    10
Freq: D, dtype: int64

In [24]:
ave_series = pd.Series([1,2,3,4,5,6,7,8,9,10], index=pd.date_range(start_date, periods=10))
ave_df_cars['Extra'] = ave_series * 10 + 2 
ave_df_cars

             A   B   C   D        Cars  Extra
2021-01-01   0   1   2   3        Ford     12
2021-01-02   4   5   6   7        Opel     22
2021-01-03   8   9  10  11       Mazda     32
2021-01-04  12  13  14  15  Mitsubishi     42
2021-01-05  16  17  18  19     Renault     52
2021-01-06  20  21  22  23        Lada     62
2021-01-07  24  25  26  27      Hammer     72
2021-01-08  28  29  30  31         BMW     82
2021-01-09  32  33  34  35    Mercedes     92
2021-01-10  36  37  38  39          VW    102

In [25]:
ave_df_cars.at[dates[4], 'Cars'] = 'Citroen'
ave_df_cars

             A   B   C   D        Cars  Extra
2021-01-01   0   1   2   3        Ford     12
2021-01-02   4   5   6   7        Opel     22
2021-01-03   8   9  10  11       Mazda     32
2021-01-04  12  13  14  15  Mitsubishi     42
2021-01-05  16  17  18  19     Citroen     52
2021-01-06  20  21  22  23        Lada     62
2021-01-07  24  25  26  27      Hammer     72
2021-01-08  28  29  30  31         BMW     82
2021-01-09  32  33  34  35    Mercedes     92
2021-01-10  36  37  38  39          VW    102

In [26]:
ave_df_cars.iat[3,2] = 666
ave_df_cars

             A   B    C   D        Cars  Extra
2021-01-01   0   1    2   3        Ford     12
2021-01-02   4   5    6   7        Opel     22
2021-01-03   8   9   10  11       Mazda     32
2021-01-04  12  13  666  15  Mitsubishi     42
2021-01-05  16  17   18  19     Citroen     52
2021-01-06  20  21   22  23        Lada     62
2021-01-07  24  25   26  27      Hammer     72
2021-01-08  28  29   30  31         BMW     82
2021-01-09  32  33   34  35    Mercedes     92
2021-01-10  36  37   38  39          VW    102

In [27]:
ave_df_cars.iat[4,2] = 666
ave_df_cars

             A   B    C   D        Cars  Extra
2021-01-01   0   1    2   3        Ford     12
2021-01-02   4   5    6   7        Opel     22
2021-01-03   8   9   10  11       Mazda     32
2021-01-04  12  13  666  15  Mitsubishi     42
2021-01-05  16  17  666  19     Citroen     52
2021-01-06  20  21   22  23        Lada     62
2021-01-07  24  25   26  27      Hammer     72
2021-01-08  28  29   30  31         BMW     82
2021-01-09  32  33   34  35    Mercedes     92
2021-01-10  36  37   38  39          VW    102

In [28]:
ave_new_array = np.array(np.arange(len(ave_df_cars))) * 10 + 5 
ave_new_array

array([ 5, 15, 25, 35, 45, 55, 65, 75, 85, 95])

In [29]:
ave_df_cars['E'] = ave_new_array
ave_df_cars

             A   B    C   D        Cars  Extra   E
2021-01-01   0   1    2   3        Ford     12   5
2021-01-02   4   5    6   7        Opel     22  15
2021-01-03   8   9   10  11       Mazda     32  25
2021-01-04  12  13  666  15  Mitsubishi     42  35
2021-01-05  16  17  666  19     Citroen     52  45
2021-01-06  20  21   22  23        Lada     62  55
2021-01-07  24  25   26  27      Hammer     72  65
2021-01-08  28  29   30  31         BMW     82  75
2021-01-09  32  33   34  35    Mercedes     92  85
2021-01-10  36  37   38  39          VW    102  95

# Missing data

In [30]:
laptops = ['Lenovo', 'Dell', 'HP', 'Chromebook', 'MacBook']
laptops_df = pd.DataFrame({
    'price' : [350, 400, 500, 560, 1000],
    'disc_space' : [0.5, 1, 2, 3, 1.5]},
    index=laptops
)

laptops_df

            price  disc_space
Lenovo        350         0.5
Dell          400         1.0
HP            500         2.0
Chromebook    560         3.0
MacBook      1000         1.5

In [31]:
more_laptops = ['Lenovo', 'Dell', 'HP', 'Huawei', 'MacBook']
laptops_df_2 = laptops_df.reindex(more_laptops)
laptops_df_2

          price  disc_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
Huawei      NaN         NaN
MacBook  1000.0         1.5

In [32]:
laptops_df_3 = laptops_df_2.dropna(how='any')
laptops_df_3

          price  disc_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
MacBook  1000.0         1.5

In [33]:
laptops_df_2.fillna(value=100)

          price  disc_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
Huawei    100.0       100.0
MacBook  1000.0         1.5

In [34]:
pd.isnull(laptops_df_2)

         price  disc_space
Lenovo   False       False
Dell     False       False
HP       False       False
Huawei    True        True
MacBook  False       False

In [35]:
laptops_df_2 * 10

           price  disc_space
Lenovo    3500.0         5.0
Dell      4000.0        10.0
HP        5000.0        20.0
Huawei       NaN         NaN
MacBook  10000.0        15.0

# stats

In [36]:
pd.set_option('display.precision', 2)
laptops_df_2.describe()

         price  disc_space
count     4.00        4.00
mean    562.50        1.25
std     298.26        0.65
min     350.00        0.50
25%     387.50        0.88
50%     450.00        1.25
75%     625.00        1.62
max    1000.00        2.00

In [37]:
laptops_df_2.mean()

price         562.50
disc_space      1.25
dtype: float64

In [38]:
laptops_df_2.mean(1)

Lenovo     175.25
Dell       200.50
HP         251.00
Huawei        NaN
MacBook    500.75
dtype: float64

In [39]:
laptops_df_2.apply(np.cumsum, axis=0)

          price  disc_space
Lenovo    350.0         0.5
Dell      750.0         1.5
HP       1250.0         3.5
Huawei      NaN         NaN
MacBook  2250.0         5.0

In [40]:
pieces = [laptops_df_2[:1], laptops_df_2[1:3], laptops_df_2[3:]]
pieces

[        price  disc_space
 Lenovo  350.0         0.5,
       price  disc_space
 Dell  400.0         1.0
 HP    500.0         2.0,
           price  disc_space
 Huawei      NaN         NaN
 MacBook  1000.0         1.5]

In [41]:
new_list = pieces[0], pieces[2]
pd.concat(new_list)

          price  disc_space
Lenovo    350.0         0.5
Huawei      NaN         NaN
MacBook  1000.0         1.5

In [42]:
new_last_row = laptops_df_2.iloc[2]

In [48]:
bank_df = pd.read_csv("/Users/danialmendigali/jupyter-datascience/Pandas/data set /bank.csv")
print(bank_df.head(100))

   age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0   30;"unemployed";"married";"primary";"no";1787;...
1   33;"services";"married";"secondary";"no";4789;...
2   35;"management";"single";"tertiary";"no";1350;...
3   30;"management";"married";"tertiary";"no";1476...
4   59;"blue-collar";"married";"secondary";"no";0;...
..                                                ...
95  41;"unknown";"single";"tertiary";"no";1567;"no...
96  41;"admin.";"married";"tertiary";"no";5426;"ye...
97  30;"admin.";"single";"tertiary";"no";261;"no";...
98  36;"blue-collar";"divorced";"secondary";"no";2...
99  31;"unemployed";"single";"primary";"no";406;"n...

[100 rows x 1 columns]

In [49]:
bank_df.to_csv("/Users/danialmendigali/jupyter-datascience/Pandas/data set /bank_updated.csv")

In [50]:
online_retail_df = pd.read_excel('/Users/danialmendigali/jupyter-datascience/Pandas/data set /Online Retail.xlsx')

In [46]:
online_retail_df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [47]:
online_retail_df.groupby("Quantity").sum()

TypeError: can only concatenate str (not "int") to str